#-*- coding: utf-8 -*-

'''
Created on 2017. 8. 10.

@author: JoSoowoon
'''

class Game:
    '''
    게임을 구성하는 클래스
    '''
   
    command = ''
    isTerminate = False
   
    #-------------------------------------------------------------------------------
    def __init__(self):
        '''
        생성자
        '''
        
        print('Game 생성자')
   
    #-------------------------------------------------------------------------------
    def Initialize(self):
        '''
        초기화
        '''
        
        print("Game 초기화")
   
    #-------------------------------------------------------------------------------
    def Process(self):
        '''
        실행
        '''
        
        print("Game 진행")
    
        print("명령을 입력하세요 : ")
        self.command = input()

